   #                                                  Titanic Exercise I
   #### Practice pandas

![titanic](https://userscontent2.emaze.com/images/a5f68f37-6349-4065-a1fc-921cbe7401b2/958230111417e36d6b3c67ffd7bc3494.jpeg)

First of all, import the needed libraries.

In [65]:
import pandas as pd
import numpy as np


# you will have to import at least another library along the exercise do it in here when the time comes

1. Read in filename and call the variable `titanic`
    - Explore the `titanic` dataset using `info`, `dtypes` & `describe`

In [66]:
filename = "titanic.csv"

In [67]:
#your code
titanic = pd.read_csv ('data/titanic.csv')

In [68]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [69]:
titanic.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [70]:
titanic.describe

<bound method NDFrame.describe of       pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
1          1         1                   Allison, Master. Hudson Trevor
2          1         0                     Allison, Miss. Helen Loraine
3          1         0             Allison, Mr. Hudson Joshua Creighton
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
...      ...       ...                                              ...
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine
1306       3         0                        Zakarian, Mr. Mapriededer
1307       3         0                              Zakarian, Mr. Ortin
1308       3         0                               Zimmerman, Mr. Leo

         sex    age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.00      0      0   24160  211.3375       B5        S    2
1       male   0.92      1      2  113781  151.5500  C22 C26        S   11
2     female   2.00      1      2  113781  151.5500  C22 C26        S  NaN
3       male  30.00      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.00      1      2  113781  151.5500  C22 C26        S  NaN
...      ...    ...    ...    ...     ...       ...      ...      ...  ...
1304  female  14.50      1      0    2665   14.4542      NaN        C  NaN
1305  female    NaN      1      0    2665   14.4542      NaN        C  NaN
1306    male  26.50      0      0    2656    7.2250      NaN        C  NaN
1307    male  27.00      0      0    2670    7.2250      NaN        C  NaN
1308    male  29.00      0      0  315082    7.8750      NaN        S  NaN

       body                        home.dest
0       NaN                     St Louis, MO
1       NaN  Montreal, PQ / Chesterville, ON
2       NaN  Montreal, PQ / Chesterville, ON
3     135.0  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
...     ...                              ...
1304  328.0                              NaN
1305    NaN                              NaN
1306  304.0                              NaN
1307    NaN                              NaN
1308    NaN                              NaN

[1309 rows x 14 columns]>

2. Create a separate dataframe with the columns `['name', 'sex', 'age']`, call it `people`

It can be done two ways, do it both!

In [71]:
#your code
people = titanic[['name', 'sex','age' ]]

In [72]:
people = titanic.loc[:,['name', 'sex','age' ]]

3. Print the output of `people` showing the first three rows and the last four rows, using `append`,`tail` and `head`

In [73]:
#your code
people_1 = people.head(3)
people_2 = people.tail(4)

people_1.append(people_2)

                                name     sex    age
0      Allen, Miss. Elisabeth Walton  female  29.00
1     Allison, Master. Hudson Trevor    male   0.92
2       Allison, Miss. Helen Loraine  female   2.00
1305           Zabour, Miss. Thamine  female    NaN
1306       Zakarian, Mr. Mapriededer    male  26.50
1307             Zakarian, Mr. Ortin    male  27.00
1308              Zimmerman, Mr. Leo    male  29.00

4. Slice the row from 3 to 9, call it `s_titanic`

In [74]:
#your code
s_titanic = titanic.drop(titanic.index[range(3,10)])

5. Slice the row from 40 to 63 in reverse order, call it `s_titanic_rev`

In [75]:
#your code
titanic_rev = titanic[::-1].reset_index()
s_titanic_rev = titanic.drop(titanic.index[range(40,64)])

6. Slice the columns from the starting column to `'parch'`, call it `left_columns`

In [76]:
#your code
left_columns = titanic.iloc[:,0:7]

7. Slice the columns from `'name'` to `'age'`, call it `middle_columns`

In [77]:
#your code
middle_columns = titanic.iloc[:,2:5]

8. Slice the columns from `'ticket'` to the end, call it `right_columns`

In [78]:
#your code
right_columns = middle_columns = titanic.iloc[:,7:]

9. What is the name of the oldest person who died in the Titanic? Was he or she travelling alone or had any family travelling with them?

In [88]:
#your code

died = titanic[(titanic.survived.isin([0]))]

died["name"][died.age == died.age.max()].values[0]

'Svensson, Mr. Johan'

In [101]:

died.loc[(died.name == 'Svensson, Mr. Johan')]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1235,3,0,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.775,NaN,S,NaN,NaN,NaN

In order to give an answer to the second question you should find out which columns give you that info. Usually part of your job as a Data Scientist will be get to know the dataset which you are working with. In this case the columns which give you that info are the following: 
        - 'sibsp' Number of Siblings/Spouses Aboard
        - 'parch' Number of Parents/Children Aboard

10. Create the list of 5 random numbers of rows from 0 to the lenght of the dataframe, call it `rows`

ex. `rows = [3,7,99,52,48]` use `random` library

In [18]:
#your code
import random
rows = []
for x in range(5): 
    numero = random.randint(0,len(titanic))
    rows.append(numero)


row = {'row': rows }
row = pd.DataFrame(row)

This list of numbers are random, could be different.

11. Create the list of three column labels, call it `cols`

In [19]:
#your code
col1 = []
for x in range(5): 
    numero = random.randint(0,len(titanic))
    col1.append(numero)

col1 = {'col1': col1 }
col1 = pd.DataFrame(col1)

In [20]:
col2 = []
for x in range(5): 
    numero = random.randint(0,len(titanic))
    col2.append(numero)

col2 = {'col2': col2 }
col2 = pd.DataFrame(col2)

In [21]:
col3 = []
for x in range(5): 
    numero = random.randint(0,len(titanic))
    col3.append(numero)

col3 = {'col3': col3 }
col3 = pd.DataFrame(col3)

12. Use both lists `rows` and `cols` to create a new dataframe

In [22]:
#your code
new_df = pd.concat([row, col1, col2, col3], axis=1)
new_df

   row  col1  col2  col3
0   23  1053   994   154
1  818   899   517  1146
2  667  1309  1251   685
3  821   125  1239   674
4  565   953   156   797

13. Create a boolean array with the condition of being a woman or a man, using the `sex` column, where **female** is True. Call it `array_fe`

In [23]:
array_fe=[]
for i in titanic['sex']:
    if i == 'female':
        array_fe.append(True)
    elif i == 'male':
        array_fe.append(False)
    
array_fe = np.array(array_fe)
array_fe

array([ True, False,  True, ..., False, False, False])

Bonus: Rename the column `"sex"` to `"gender"`

In [24]:
#your code
titanic.rename(columns = {'sex':'genre'})

,pclass,survived,name,genre,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

14. Filter the `titanic` dataframe with the boolean array, call it `woman_titanic`

In [25]:
#your code

woman_titanic = titanic[array_fe]
len(woman_titanic)

466

15. How many woman were younger than 18? Call the variable `minor_wo`

In [26]:
minor_wo = woman_titanic[woman_titanic['age']< 18]
len(minor_wo)

72

16. How many woman that were less than 18 actually died? Call the variable `dead_wo`

In [27]:
#your code

dead_wo = minor_wo[minor_wo['survived'] == 0]
len(dead_wo)

22

17. Drop rows with *Nan* in `titanic` with `how='any'` and print the shape

In [28]:
# borra las filas con missing value how = 'any'
# borra las filas en las que hay algún missing

titanic_1 = titanic.dropna(how = 'any')
titanic_1.shape

(0, 14)

In [29]:
#borra las filas con missing value how = 'all'
# borra las filas en las que todos los valores son missing
titanic_2 = titanic.dropna( how ='all')
titanic_2.shape

(1309, 14)

Check in [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html) why the shapes are different.

19. Drop columns in `titanic` with more than 1000 missing values and print the columns remaining

In [30]:

titanic_3 = titanic.dropna (thresh = 1000)
titanic_3.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

20. Calculate the ratio of missing values at the `boat` column.

In [31]:
#your code
na_ratio = (titanic['boat'].isnull().sum() /len(titanic['boat']* 100))

na_ratio

0.6287242169595111

21.  Group `titanic` by `'pclass'` and aggregate by the columns `age` & `fare`, by `max` and `median` --> `by_class`

In [32]:
#your code
titanic.groupby(["pclass"]).aggregate({'age':['max', 'median'],'fare': ['max', 'median']})

         age             fare
         max median       max   median
pclass
1       80.0   39.0  512.3292  60.0000
2       70.0   29.0   73.5000  15.0458
3       74.0   24.0   69.5500   8.0500

22. Print the maximum age in each class from `by_class`

In [33]:
#your code
titanic.groupby(["pclass"]).aggregate({'age':['max']})

         age
         max
pclass
1       80.0
2       70.0
3       74.0

23. Print the median fare in each class from `by_class`

In [34]:
#your code
titanic.groupby(["pclass"]).aggregate({'fare':['median']})

           fare
         median
pclass
1       60.0000
2       15.0458
3        8.0500

24. Using [`.pivot_table()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) to count how many women or men survived by class, call it `counted`.

Don't panic and read the documentation!

In [35]:
#your code

counted = pd.pivot_table (titanic,values = 'survived', index =['pclass'],columns=['sex'], aggfunc = np.sum)

counted

sex     female  male
pclass
1          139    61
2           94    25
3          106    75

25. Add a new column with the sum of survived men and women, call it `counted['total']`

In [36]:
#your code
counted['total'] = counted['female'] + counted['male']

counted

sex     female  male  total
pclass
1          139    61    200
2           94    25    119
3          106    75    181

26. Sort `counted` by the `'total'` column. In which class the people survived the more?

In [37]:
#your code

counted_sort = counted.sort_values('total', ascending = False)

counted_sort

sex     female  male  total
pclass
1          139    61    200
3          106    75    181
2           94    25    119

27. Please, show only the rows using a mask with the following conditions: 
    - They are woman
    - From third class
    - Younger than 30
    - They survived
    
    ¿How many rows fulfill the condition?

In [44]:
#your code
menores_30 = titanic['age'] < 30

wo_clas3_survived = titanic[titanic.sex.isin(['female']) & titanic.pclass.isin([3]) & titanic.survived.isin([1])]

wo_clas3_survived_l30 = wo_clas3_survived[menores_30]

wo_clas3_survived_l30.shape

<ipython-input-44-923e8dae490a>:6: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  wo_clas3_survived_l30 = wo_clas3_survived[menores_30]

(57, 14)

28. Now, show only the rows using `.loc` with the following conditions: 
    - They are man
    - From first class
    - Older than 50
    - They died
    
    ¿How many rows fulfill the condition?

In [46]:
#your code
men_clas1_survived_u50 = titanic.loc[(titanic.age > 50) & (titanic.sex == 'male') & (titanic.pclass == 1) & (titanic.survived == 0)]

men_clas1_survived_u50.shape

(29, 14)

29. Print the uniques values at the column `'name'`

In [48]:
#your code

titanic['name'].unique()

array(['Allen, Miss. Elisabeth Walton', 'Allison, Master. Hudson Trevor',
       'Allison, Miss. Helen Loraine', ..., 'Zakarian, Mr. Mapriededer',
       'Zakarian, Mr. Ortin', 'Zimmerman, Mr. Leo'], dtype=object)

30. Find if was there any `name` repeated at the Titanic?

Hint: There were two people with the same name, who?

In [57]:
#your code
titanic[titanic.duplicated('name')]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
726,3,0,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q,NaN,NaN,Ireland
925,3,0,"Kelly, Mr. James",male,44.0,0,0,363592,8.0500,NaN,S,NaN,NaN,NaN

31. Well done! You did it! I can tell you are a real master with Pandas. Please, now save the dataframe as a `.csv` since you will use it in a future exercise `Titanic-Visualisation`. The name of the `.csv` you'll generate should be `titanic_cleaned.csv`.

Use for that aim the following pandas's method: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html

Make sure you use the argument `index = False`.

In [107]:
#your code
titanic.to_csv ('data/titanic_cleaned.csv',index=False)